Rails-API/backend/app/controllers/api/v1/students_controller.rb

    def show
        student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]